BrianPugh/cookiecutter-esp32-webserver/{{cookiecutter.project_name}}/src/main.c

/* OTA example
   This example code is in the Public Domain (or CC0 licensed, at your option.)
   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/

#include "esp_idf_version.h"

#include "driver/gpio.h"
#include "esp_event.h"
#include "esp_http_client.h"
#include "esp_https_ota.h"
#include "esp_log.h"
#include "esp_ota_ops.h"
#include "esp_sntp.h"
#include "esp_vfs_semihost.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "lwip/apps/netbiosns.h"
#include "mdns.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "sdkconfig.h"
#include "string.h"

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 2, 0)
#define ESP_IDF_NETIF_AVAILABLE true
#else
#define ESP_IDF_NETIF_AVAILABLE false
#endif

#if ESP_IDF_NETIF_AVAILABLE
#include "esp_netif.h"
#endif

#include "filesystem.h"
#include "helpers.h"
#include "led.h"
#include "server.h"


static const char *TAG = "{{cookiecutter.project_var_name}}-main";
static EventGroupHandle_t s_wifi_event_group;

#define MDNS_INSTANCE "mds instance"

/* Friendly bit indices into the Event Group Bits */
#define WIFI_CONNECTED_BIT BIT0
#define WIFI_FAIL_BIT      BIT1


static void initialize_mdns(const char *hostname)
{
    mdns_init();
    mdns_hostname_set(hostname);
    mdns_instance_name_set(MDNS_INSTANCE);

    mdns_txt_item_t serviceTxtData[] = {
        {"board", "esp32"},
        {"path", "/"}
    };

    ESP_ERROR_CHECK(mdns_service_add("ESP32-WebServer", "_http", "_tcp", 80, serviceTxtData,
                                     sizeof(serviceTxtData) / sizeof(serviceTxtData[0])));
}

static void initialize_sntp(void)
{
    static char *ntp_server = NULL;
    ESP_LOGI(TAG, "Initializing SNTP");
    sntp_setoperatingmode(SNTP_OPMODE_POLL);
    if(ntp_server) free(ntp_server);
    ntp_server = nvs_get_str_default("ntp", "server", "pool.ntp.org");
    ESP_LOGI(TAG, "Setting NTP server as %s", ntp_server);
    sntp_setservername(0, ntp_server);
    /* We don't free ntp_server here because i believe sntp internally doesn't
     * make a copy */

    /* You can set a callback that triggers on synchronization of form:
     *      void time_sync_notification_cb(struct timeval *tv)
     */
    //sntp_set_time_sync_notification_cb(time_sync_notification_cb);
    /* Other options: SNTP_SYNC_MODE_SMOOTH*/
    sntp_set_sync_mode(SNTP_SYNC_MODE_IMMED);
    sntp_init();

    {
        uint8_t retry = 0;
        const uint8_t retry_count = 10;
        while (sntp_get_sync_status() == SNTP_SYNC_STATUS_RESET && ++retry < retry_count) {
            ESP_LOGI(TAG, "Waiting for system time to be set... (%d/%d)", retry, retry_count);
            vTaskDelay(2000 / portTICK_PERIOD_MS);
        }
    }
}

static void event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    static uint8_t s_retry_num = 0;
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        if (s_retry_num < 5) {
            esp_wifi_connect();
            s_retry_num++;
            ESP_LOGI(TAG, "retry to connect to the AP");
        } else {
            xEventGroupSetBits(s_wifi_event_group, WIFI_FAIL_BIT);
        }
        ESP_LOGI(TAG,"connect to the AP fail");
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        ESP_LOGI(TAG, "got ip:" IPSTR, IP2STR(&event->ip_info.ip));
        s_retry_num = 0;
        xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
    }
}

/**
 * @brief Connect to the wifi network described in project config.
 *
 * Blocks until connection is successful
 */
static void wifi_init_sta(void)
{
    s_wifi_event_group = xEventGroupCreate();

#if ESP_IDF_NETIF_AVAILABLE
    ESP_ERROR_CHECK(esp_netif_init());
#else
    tcpip_adapter_init();
#endif

    ESP_ERROR_CHECK(esp_event_loop_create_default());

#if ESP_IDF_NETIF_AVAILABLE
    esp_netif_t *sta_netif = esp_netif_create_default_wifi_sta();
    assert(sta_netif);
#endif

    {
        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    }

#if ESP_IDF_NETIF_AVAILABLE
    esp_event_handler_instance_t instance_any_id;
    esp_event_handler_instance_t instance_got_ip;
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
                                                        ESP_EVENT_ANY_ID,
                                                        &event_handler,
                                                        NULL,
                                                        &instance_any_id));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,
                                                        IP_EVENT_STA_GOT_IP,
                                                        &event_handler,
                                                        NULL,
                                                        &instance_got_ip));
#else
    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &event_handler, NULL));
#endif

    wifi_config_t wifi_config = {
        .sta = {
            .ssid = CONFIG_PROJECT_WIFI_SSID,
            .password = CONFIG_PROJECT_WIFI_PASS,
#if ESP_IDF_NETIF_AVAILABLE
            /* for some reason this isn't defined in v4.1-beta2 */
            .pmf_cfg = {
                .capable = true,
                .required = false
            },
#endif
        },
    };
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA) );
    ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_config) );
    ESP_ERROR_CHECK(esp_wifi_start() );

    ESP_LOGI(TAG, "wifi_init_sta finished.");

    /* Waiting until either the connection is established (WIFI_CONNECTED_BIT) or connection failed for the maximum
     * number of re-tries (WIFI_FAIL_BIT). The bits are set by event_handler() (see above) */
    EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
            WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
            pdFALSE,
            pdFALSE,
            portMAX_DELAY);

    /* xEventGroupWaitBits() returns the bits before the call returned, hence we can test which event actually
     * happened. */
    if (bits & WIFI_CONNECTED_BIT) {
        ESP_LOGI(TAG, "connected to ap");
    } else if (bits & WIFI_FAIL_BIT) {
        ESP_LOGI(TAG, "Failed to connect");
    } else {
        ESP_LOGE(TAG, "UNEXPECTED EVENT");
    }

#if ESP_IDF_NETIF_AVAILABLE
    /* The event will not be processed after unregister */
    ESP_ERROR_CHECK(esp_event_handler_instance_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, instance_got_ip));
    ESP_ERROR_CHECK(esp_event_handler_instance_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID, instance_any_id));
    vEventGroupDelete(s_wifi_event_group);
#endif
}


void app_main(void)
{
    esp_err_t err;
    
    /* Initialize NVS. */
    err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        // 1.OTA app partition table has a smaller NVS partition size than the non-OTA
        // partition table. This size mismatch may cause NVS initialization to fail.
        // 2.NVS partition contains data in new format and cannot be recognized by this version of code.
        // If this happens, we erase NVS partition and initialize NVS again.
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    /* Initialize Filesystem */
    ESP_ERROR_CHECK(init_fs());

    /* Initialize Wifi */
    wifi_init_sta();

    /* Synchronize system clock */
    initialize_sntp();    

    /* Setup GPIO */
    led_setup();

    /* Setup DNS */
    {
        char *hostname = get_hostname();
        initialize_mdns(hostname);
        netbiosns_init();
        netbiosns_set_name(hostname);
        ESP_LOGI(TAG, "Access device at http://%s.local", hostname);
        free(hostname);
    }

    /* Start Server */
    ESP_ERROR_CHECK(server_init(CONFIG_PROJECT_FS_MOUNT_POINT));
}
